; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(obj ?obj)
	       	(truck ?truck)
               	(location ?loc)
		(airplane ?airplane)
                (city ?city)
                (airport ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city)
                (connected ?loc1 ?loc2)
       ; (dummy-goal)
       ; (dummy-fact)
(dummy-goal)(dummy-fact)(dummy-tabustate0))
(:functions (cost));(:functions (cost))
 
  ; (:types )		; default object

(:action load-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (obj ?obj) (truck ?truck) (location ?loc) ;(dummy-fact)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action load-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (obj ?obj) (airplane ?airplane) (location ?loc) ;(dummy-fact)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action unload-truck
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (obj ?obj) (truck ?truck) (location ?loc) ;(dummy-fact)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action unload-airplane
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (obj ?obj) (airplane ?airplane) (location ?loc) ;(dummy-fact)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action drive-truck
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (truck ?truck) (location ?loc-from) (location ?loc-to) (city ?city)
   (at ?truck ?loc-from) ;(dummy-fact)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action fly-airplane
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (connected ?loc-from ?loc-to) (airplane ?airplane) (airport ?loc-from) (airport ?loc-to) ;(dummy-fact)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

;(:action pref-op0
;  :precondition (and (dummy-fact))
;  :effect (and (not (dummy-fact)) (dummy-goal)))

(:action pref-op0
  :precondition (and (dummy-fact))
  :effect (and (not (dummy-fact)) (dummy-goal)))(:action pref-op1
:precondition (and (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(at a0 l20)
(at a1 l10)
(at p0 l21)
(at p1 l21)
(at p2 l11)
(at t0 l00)
(at t1 l10)
(at t2 l21)
(city c0) 
(city c1) 
(city c2) 
(connected l00 l10) 
(connected l00 l20) 
(connected l10 l00) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(obj p0) 
(obj p1) 
(obj p2) 
(truck t0) 
(truck t1) 
(truck t2) 
)
:effect (and (not (dummy-fact)) (dummy-goal) (increase (cost) 100)))

(:action tabu-op0-1
:precondition (and (not (dummy-fact)) (not (airplane a0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-2
:precondition (and (not (dummy-fact)) (not (airplane a1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-3
:precondition (and (not (dummy-fact)) (not (airport l00) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-4
:precondition (and (not (dummy-fact)) (not (airport l10) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-5
:precondition (and (not (dummy-fact)) (not (airport l20) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-6
:precondition (and (not (dummy-fact)) (not (at a0 l20)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-7
:precondition (and (not (dummy-fact)) (not (at a1 l20)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-8
:precondition (and (not (dummy-fact)) (not (at p0 l21)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-9
:precondition (and (not (dummy-fact)) (not (at p1 l21)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-10
:precondition (and (not (dummy-fact)) (not (at p2 l11)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-11
:precondition (and (not (dummy-fact)) (not (at t0 l00)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-12
:precondition (and (not (dummy-fact)) (not (at t1 l10)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-13
:precondition (and (not (dummy-fact)) (not (at t2 l21)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-14
:precondition (and (not (dummy-fact)) (not (city c0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-15
:precondition (and (not (dummy-fact)) (not (city c1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-16
:precondition (and (not (dummy-fact)) (not (city c2) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-17
:precondition (and (not (dummy-fact)) (not (connected l00 l10) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-18
:precondition (and (not (dummy-fact)) (not (connected l00 l20) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-19
:precondition (and (not (dummy-fact)) (not (connected l10 l00) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-20
:precondition (and (not (dummy-fact)) (not (in-city l00 c0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-21
:precondition (and (not (dummy-fact)) (not (in-city l01 c0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-22
:precondition (and (not (dummy-fact)) (not (in-city l10 c1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-23
:precondition (and (not (dummy-fact)) (not (in-city l11 c1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-24
:precondition (and (not (dummy-fact)) (not (in-city l20 c2) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-25
:precondition (and (not (dummy-fact)) (not (in-city l21 c2) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-26
:precondition (and (not (dummy-fact)) (not (location l00) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-27
:precondition (and (not (dummy-fact)) (not (location l01) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-28
:precondition (and (not (dummy-fact)) (not (location l10) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-29
:precondition (and (not (dummy-fact)) (not (location l11) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-30
:precondition (and (not (dummy-fact)) (not (location l20) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-31
:precondition (and (not (dummy-fact)) (not (location l21) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-32
:precondition (and (not (dummy-fact)) (not (obj p0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-33
:precondition (and (not (dummy-fact)) (not (obj p1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-34
:precondition (and (not (dummy-fact)) (not (obj p2) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-35
:precondition (and (not (dummy-fact)) (not (truck t0) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-36
:precondition (and (not (dummy-fact)) (not (truck t1) ))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-37
:precondition (and (not (dummy-fact)) (not (truck t2) ))
:effect (and (dummy-tabustate0)))

)

; problem
(define (problem logistics-c2-s2-p1-a1)
(:domain logistics-strips)
(:objects a0 a1
          c0 c1 c2
          t0 t1 t2
          l00 l01 l10 l11 l20 l21 
          p0 p1 p2
)
(:INIT (= (cost) 0)
	(dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(at a0 l20)
(at a1 l00)
(at p0 l21)
(at p1 l21)
(at p2 l01)
(at t0 l01)
(at t1 l10)
(at t2 l21)
(city c0) 
(city c1) 
(city c2) 
(connected l00 l10) 
(connected l00 l20) 
(connected l10 l00) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(obj p0) 
(obj p1) 
(obj p2) 
(truck t0) 
(truck t1) 
(truck t2) 
)
(:goal (and
(dummy-goal)
(at p2 l11)
(dummy-tabustate0)
))
(:metric maximize (cost))
)

; plan
1. (load-truck p2 t0 l01)
   deleted: (at p2 l01)
   added: (in p2 t0)
   goals met: 0 of 3
2. (drive-truck t0 l01 l00 c0)
   deleted: (at t0 l01)
   added: (at t0 l00)
   goals met: 0 of 3
3. (unload-truck p2 t0 l00)
   deleted: (in p2 t0)
   added: (at p2 l00)
   goals met: 0 of 3
4. (load-airplane p2 a1 l00)
   deleted: (at p2 l00)
   added: (in p2 a1)
   goals met: 0 of 3
5. (fly-airplane a1 l00 l10)
   deleted: (at a1 l00)
   added: (at a1 l10)
   goals met: 0 of 3
6. (unload-airplane p2 a1 l10)
   deleted: (in p2 a1)
   added: (at p2 l10)
   goals met: 0 of 3
7. (load-truck p2 t1 l10)
   deleted: (at p2 l10)
   added: (in p2 t1)
   goals met: 0 of 3
8. (drive-truck t1 l10 l11 c1)
   deleted: (at t1 l10)
   added: (at t1 l11)
   goals met: 0 of 3
9. (unload-truck p2 t1 l11)
   deleted: (in p2 t1)
   added: (at p2 l11)
   goals met: 1 of 3
10. (drive-truck t1 l11 l10 c1)
   deleted: (at t1 l11)
   added: (at t1 l10)
   goals met: 1 of 3
11. (pref-op1)
   deleted: (dummy-fact)
   added: (dummy-goal)
   changed: (cost) from 0 to 100
   goals met: 2 of 3
12. (tabu-op0-7)
   added: (dummy-tabustate0)
   goals met: 3 of 3
